Repository: KidGbzin/MIDlet-Store
Catalog: lib/l10n/l10n_*.arb
Languages: id, pt

# buttonCommingSoon
source: COMMING SOON
id: SEGERA HADIR
pt: EM BREVE

# buttonLoginWithGoogle
source: SIGN IN WITH GOOGLE
id: MASUK DENGAN GOOGLE
pt: ENTRAR COM O GOOGLE

# buttonReadyToInstall
source: READY TO INSTALL
id: SIAP UNTUK DIPASANG
pt: PRONTO PARA A INSTALAÇÃO

# buttonUpdateAvailable
source: UPDATE AVAILABLE
id: PEMBARUAN TERSEDIA
pt: ATUALIZAÇÂO DISPONÍVEL

# chipFilterByCategories
source: Categories
id: Kategori
pt: Categorias

# chipFilterByPublisher
source: Publisher
id: Penerbit
pt: Publicadora

# chipFilterByReleaseYear
source: Release Year
id: Tahun Rilis
pt: Ano de Lançamento

# launcherErrorMessage01
source: An error occurred, preventing the application from initializing.
id: Terjadi kesalahan yang mencegah aplikasi berjalan.
pt: Ocorreu um erro, impedindo a inicialização do aplicativo.

# launcherErrorMessage02
source: Server connection failed, please try again later.
id: Gagal terhubung ke server, coba lagi nanti.
pt: Falha na conexão com o servidor, tente novamente mais tarde.

# launcherLoadingMessage01
source: Connecting to database, please wait...
id: Menghubungkan ke database, harap tunggu...
pt: Conectando ao banco de dados, aguarde...

# launcherLoadingMessage02
source: Downloading necessary files, please wait...
id: Mengunduh file yang diperlukan, harap tunggu...
pt: Baixando arquivos necessários, aguarde...

# launcherLoadingMessage03
source: Authenticating with Supabase, please wait...
id: Mengautentikasi dengan Supabase, harap tunggu...

# launcherLoadingMessage04
source: Authenticating with Google, please wait...
id: Mengautentikasi dengan Google, harap tunggu...

# messageFiltersCleared
source: Filters cleared, showing all $1 games.
id: Filter dibersihkan, menampilkan semua $1 permainan.
pt: Os filtros foram limpos, monstrando todos os $1 jogos.

# messageFiltersApplied
source: Filters applied, showing $1 out of $2 games.
id: Filter diterapkan, menampilkan $1 dari $2 permainan.
pt: Os filtros foram aplicados, exibindo $1 de $2 jogos.

# messageFavoritesAdded
source: You added $1 to your favorites list.
id: Anda menambahkan $1 ke daftar favorit Anda.
pt: Você adicionou $1 à sua lista de favoritos.

# messageFavoritesRemoved
source: You removed $1 from your favorites list.
id: Anda menghapus $1 dari daftar favorit Anda.
pt: Você removeu $1 da sua lista de favoritos.

# messageFiltersEmpty
source: No filters applied, showing all $1 games.
id: Tidak ada filter yang diterapkan, menampilkan semua $1 permainan.
pt: Nenhum filtro aplicado, exibindo todos os $1 jogos.

# sectionFilterCategories
source: FILTER BY CATEGORIES
id: FILTER BERDASARKAN KATEGORI
pt: FILTRAR POR CATEGORIAS

# sectionFilterCategoriesDescription
source: Refine your search by selecting up to three category tags.
id: Sempurnakan pencarian Anda dengan memilih hingga tiga tag kategori.
pt: Refine sua pesquisa selecionando até três categorias.

# sectionFilterPublisher
source: FILTER BY PUBLISHER
id: FILTER BERDASARKAN PENERBIT
pt: FILTRAR POR PUBLICADORA

# sectionFilterPublisherDescription
source: Filter your search by selecting a specific publisher.
id: Filter pencarian Anda dengan memilih penerbit tertentu.
pt: Filtre sua pesquisa selecionando uma publicadora específica.

# sectionFilterReleaseYear
source: FILTER BY RELEASE YEAR
id: FILTER BERDASARKAN TAHUN RILIS
pt: FILTRAR POR ANO DE LANÇAMENTO

# sectionFilterReleaseYearDescription
source: Filter your search by selecting a specific release year.
id: Filter pencarian Anda dengan memilih tahun rilis tertentu.
pt: Filtre sua pesquisa selecionando um ano de lançamento especifico.

# btInstallOnEmulator
source: INSTALL ON EMULATOR
id: INSTAL DI EMULATOR
pt: INSTALAR NO EMULADOR

# btOpenOnBrowser
source: OPEN ON BROWSER
id: BUKA DI PERAMBAN
pt: ABRIR NO NAVEGADOR

# btPlayGame
source: PLAY GAME
id: MAIN
pt: JOGAR

# btSubmitRating
source: SUBMIT RATING
id: KIRIM PENILAIAN
pt: ENVIAR AVALIAÇÃO

# btSubmitReview
source: REVIEW GAME
id: ULAS GAME
pt: AVALIAR JOGO

# btUpdateYourRating
source: UPDATE YOUR RATING
id: PERBARUI PENILAIAN
pt: ATUALIZAR AVALIAÇÃO

# exClientExceptionTitle
source: Connection Failed
id: Koneksi Gagal
pt: Falha na conexão

# exClientExceptionMessage
source: Could not connect to the server. Please check your internet connection and try again.
id: Tidak dapat terhubung ke server. Periksa koneksi internet Anda dan coba lagi.
pt: Não foi possível se conectar ao servidor. Verifique sua conexão com a internet e tente novamente.

# exFormatExceptionTitle
source: Unexpected Error
id: Kesalahan Tak Terduga
pt: Erro inesperado

# exFormatExceptionMessage
source: Something went wrong and the operation couldn't be completed. Please try again shortly. If the problem persists, contact our support team.
id: Terjadi kesalahan dan operasi tidak dapat diselesaikan. Silakan coba lagi dalam beberapa saat. Jika masalah terus berlanjut, hubungi tim dukungan kami.
pt: Algo deu errado e não foi possível concluir a operação. Tente novamente em breve. Se o problema persistir, fale com nosso suporte.

# exHttpExceptionTitle
source: Server Unavailable
id: Server Tidak Tersedia
pt: Servidor indisponível

# exHttpExceptionMessage
source: Could not access the requested resource on the server. This may happen due to an invalid URL, server issue, or missing file.
id: Tidak dapat mengakses sumber daya yang diminta di server. Ini bisa terjadi karena URL tidak valid, masalah server, atau file tidak ditemukan.
pt: Não foi possível acessar o recurso solicitado no servidor. Isso pode ocorrer por uma URL inválida, problema no servidor ou arquivo não encontrado.

# exUnknownExceptionTitle
source: Something went wrong
id: Terjadi kesalahan
pt: Algo deu errado

# exUnknownExceptionMessage
source: Something went wrong and the operation couldn't be completed. Please try again later. If the issue persists, contact our support team.
id: Terjadi kesalahan dan operasi tidak dapat diselesaikan. Coba lagi nanti. Jika masalah berlanjut, hubungi tim dukungan kami.
pt: Algo deu errado e não foi possível concluir a operação. Tente novamente em breve. Se o problema persistir, fale com nosso suporte.

# hdReviews
source: REVIEWS
id: ULASAN
pt: AVALIAÇÕES

# lbAchievements
source: Achievements
id: Prestasi
pt: Conquistas

# lbCensored
source: Censored
id: Disensor
pt: Censurado

# lbDownloads
source: Downloads
id: Unduhan

# lbLandscape
source: Landscape
id: Lanskap
pt: Paisagem

# lbMultiplayerBluetooth
source: Multiplayer Bluetooth
id: Multipemain Bluetooth

# lbMultiplayerLocal
source: Multiplayer Local
id: Multipemain Lokal

# lbMultiscreen
source: Multiscreen
id: Layar Ganda
pt: Multitela

# lbPortrait
source: Portrait
id: Potret
pt: Retrato

# lbPublisher
source: Publisher
id: Penerbit
pt: Publicadora

# lbRelease
source: Release
id: Rilis
pt: Lançamento

# lbSize
source: Size
id: Ukuran
pt: Tamanho

# lbTouchscreen
source: Touchscreen
id: Layar Sentuh
pt: Toque

# lbVersion
source: Version
id: Versi
pt: Versão

# scEmulatorNotFound
source: SOMETHING WENT WRONG
id: ADA YANG SALAH
pt: ALGO DEU ERRADO

# scEmulatorNotFoundDescription
source: We couldn't find the @emulator emulator on your device. Please ensure it's installed before trying again.
id: Kami tidak menemukan emulator @emulator di perangkatmu. Pastikan emulator sudah terinstal sebelum mencoba lagi.
pt: Não conseguimos encontrar o emulador @emulator no seu dispositivo. Verifique se ele está instalado antes de tentar novamente.

# scEmulatorNotFoundText01
source: You can also install the @emulator emulator from one of the options below.
id: Kamu juga bisa menginstal emulator @emulator dari salah satu opsi di bawah ini.
pt: Você também pode instalar o emulador @emulator usando uma das opções abaixo.

# scEmulatorNotFoundText02
source: When there is an emulator installed, it will start automatically next time.
id: Jika emulator telah terinstal, maka akan diluncurkan secara otomatis lain kali.
pt: Quando houver um emulador instalado, ele será iniciado automaticamente na próxima vez.

# scPreviews
source: PREVIEWS
id: PRATINJAU
pt: PRÉVIAS

# scPreviewsDescription
source: The game's characteristics and previews may vary according to the model of your phone.
id: Karakteristik dan pratinjau game dapat berbeda tergantung pada model ponsel Anda.
pt: As características e prévias do jogo podem variar de acordo com o modelo do seu celular.

# scPreviewsError
source: This game doesn't have any previews available.
id: Game ini tidak memiliki pratinjau yang tersedia.
pt: Este jogo não possui prévias disponíveis.

# scAbout
source: ABOUT
id: TENTANG
pt: SOBRE

# scExternalSource
source: YOU ARE BEING REDIRECTED
id: ANDA SEDANG DIALIHKAN
pt: VOCÊ ESTÁ SENDO REDIRECIONADO

# scExternalSourceDescription
source: This MIDlet file is available at @source. To view the original file, please open the link in your web browser. Please note: This is an external website with no official affiliation to the MIDlet Store project.
id: Berkas MIDlet ini tersedia di @source. Untuk melihat berkas aslinya, silakan buka tautan tersebut di peramban Anda. Harap dicatat: Ini adalah situs eksternal yang tidak memiliki afiliasi resmi dengan proyek MIDlet Store.
pt: Este arquivo MIDlet está disponível em @source. Para visualizar o arquivo original, abra o link em seu navegador. Atenção: Este é um site externo, sem afiliação oficial ao projeto MIDlet Store.

# scRelatedGames
source: RECOMMENDED FOR YOU
id: REKOMENDASI UNTUKMU
pt: RECOMENDADOS PARA VOCÊ

# scRelatedGamesDescription
source: If you enjoyed @title, you might also enjoy these other games.
id: Jika kamu menyukai @title, kamu mungkin juga akan menyukai game-game ini.
pt: Se você gostou de @title, talvez também goste destes outros jogos.

# scRelatedPublisherDescription
source: Discover more games from @publisher that you might enjoy.
id: Temukan lebih banyak game dari @publisher yang mungkin kamu sukai.
pt: Descubra mais jogos da @publisher que você pode gostar.

# scSelectEmulator
source: SELECT EMULATOR
id: PILIH EMULATOR
pt: SELECIONE O EMULADOR

# scSelectEmulatorDescription
source: Please select which emulator you'd like to install.
id: Silakan pilih emulator yang ingin kamu pasang.
pt: Por favor, selecione em qual emulador você deseja instalar.

# scSubmitRating
source: SUBMIT RATING
id: KIRIM PENILAIAN
pt: ENVIAR AVALIAÇÃO

# scSubmitRatingDescriptionRated
source: Looks like you've already rated this game with @star stars. Would you like to update your rating?
id: Sepertinya Anda sudah memberi @star bintang untuk game ini. Ingin memperbarui penilaian Anda?
pt: Parece que você já avaliou este jogo com @star estrelas. Deseja atualizar sua avaliação?

# scSubmitRatingDescriptionNotRated
source: You haven't rated this game yet. Share your opinion by giving it a rating!
id: Anda belum memberi penilaian untuk game ini. Bagikan pendapat Anda dengan memberikan penilaian!
pt: Você ainda não avaliou este jogo. Compartilhe sua opinião dando uma nota!

# tgAction
source: Action
id: Aksi
pt: Ação

# tgAdventure
source: Adventure
id: Petualangan
pt: Aventura

# tgCasual
source: Casual
id: Kasual

# tgDriving
source: Driving
id: Menyetir
pt: Direção

# tgExtremeSports
source: Extreme Sports
id: Olahraga Ekstrem
pt: Esportes Radicais

# tgFighting
source: Fighting
id: Pertarungan
pt: Luta

# tgFootball
source: Football
id: Sepak Bola
pt: Futebol

# tgOpenWorld
source: Open World
id: Dunia Terbuka
pt: Mundo Aberto

# tgPowerUps
source: Power-Ups
id: Power-Up

# tgPuzzle
source: Puzzle
id: Teka-Teki
pt: Quebra-Cabeça

# tgRacing
source: Racing
id: Balapan
pt: Corrida

# tgRally
source: Rally
id: Reli
pt: Rali

# tgSciFi
source: Sci-Fi
id: Fiksi Ilmiah
pt: Ficção Científica

# tgShooter
source: Shooter
id: Penembak
pt: Tiro

# tgSports
source: Sports
id: Olahraga
pt: Esportes

# tgStarfighter
source: Starfighter
id: Pesawat Tempur
pt: Nave de Combate

# tgStealth
source: Stealth
id: Siluman
pt: Furtivo

# tgStrategy
source: Strategy
id: Strategi
pt: Estratégia

# tgSurvivalHorror
source: Survival Horror
id: Horror Bertahan Hidup
pt: Terror de Sobrevivência

# tgTakedown
source: Takedown
id: Penaklukan

# tgTerror
source: Terror
id: Teror

# tgTowerDefense
source: Tower Defense
id: Pertahanan Menara
pt: Defesa de Torres

# txRating1Star
source: Really disappointing. Didn't enjoy it at all. 😞
id: Sangat mengecewakan. Tidak menikmati sama sekali. 😞
pt: Muito decepcionante. Não gostei nada. 😞

# txRating2Star
source: Not great. It has some serious flaws. 😕
id: Kurang bagus. Banyak kekurangannya. 😕
pt: Ruim. Tem falhas sérias. 😕

# txRating3Star
source: It's okay, but there's room for improvement. 😐
id: Lumayan, tapi masih bisa lebih baik. 😐
pt: É ok, mas dá pra melhorar. 😐

# txRating4Star
source: Pretty good! Had a lot of fun. 👍
id: Bagus banget! Sangat menyenangkan. 👍
pt: Muito bom! Me diverti bastante. 👍

# txRating5Star
source: This game is awesome, I love it! 😍
id: Game ini luar biasa, saya suka banget! 😍
pt: Esse jogo é incrível, adorei! 😍

# txSubmitReview
source: Give us a short review!
id: Tulis ulasan singkat!
pt: Escreva uma breve avaliação!

# tgBreakout
source: Breakout
pt: Quebra-Blocos

# tgPlatformer
source: Platformer
pt: Plataforma
